{
  "cultural_date_format": "%d-%m-%Y",
  "languages": ["cs", "en"],
  "translation": [
      {"cs": "KOKS: Korpusová kalkulačka spolehlivosti", "en": "C3O: Corpus confidence calculator online"},
      {"cs": "Trvalý odkaz", "en": "Bookmark"},
      {"cs": "URL ke sdílení", "en": "URL for sharing"},
      {"cs": "1 slovo v 1 korpusu", "en": "1 word in 1 corpus"},
      {"cs": "Zadání", "en": "Input"},
      {"cs": "Zjištěná frekvence", "en": "Observed frequency"},
      {"cs": "Velikost korpusu", "en": "Corpus size"},
      {"cs": "Velikost korpusu (slova nebo pozice)", "en": "Corpus size (tokens or words)"},
      {"cs": "1 mil.", "en": "1m"},
      {"cs": "100 mil.", "en": "100m"},
      {"cs": "1 mld.", "en": "1bn"},
      {"cs": "10 mld.", "en": "10bn"},
      {
        "cs": "Poznámka: Není důležité, s jakým korpusem jste přesně pracovali, jde o jeho přibližný rozsah.",
        "en": "Note: It doesn't really matter which corpus you're working with, it's the approximate size we're after here."
      },
      {"cs": "Hladina významnosti (α):", "en": "Significance level (α):"},
      {"cs": "α = přijatelná pravděpodobnost omylu", "en": "α = acceptable level of error"},
      {"cs": "Konfidenční intervaly", "en": "Confidence intervals"},
      {"cs": "Konfidenční interval", "en": "Confidence interval"},
      {"cs": "konfidenční interval", "en": "confidence interval"},
      {"cs": "Frekvence", "en": "Frequency"},
      {"cs": "Spodní mez konfidenčního intervalu", "en": "Confidence interval - lower limit"},
      {"cs": "Horní mez konfidenčního intervalu", "en": "Confidence interval - upper limit"},
      {"cs": "Pravděpodobnostní funkce", "en": "Probability function"},
      {"cs": "Pravděpodobnost", "en": "Probability"},
      {
        "cs": "V tomto modulu můžem najít odpověď na otázku, jak korektně interpretovat frekvence naměřené v&nbsp;korpusu. Při práci s korpusovými daty občas zapomínáme na to, že naměřená frekvence jevu je pouze <em>bodovým odhadem</em> jeho skutečné frekvence v&nbsp;jazyce. Vzhledem ke všudypřítomné variabilitě způsobené mnoha faktory souvisejícími s&nbsp;vytvářením korpusu, jeho zpracováním i se samotným vyhodnocováním dotazu je spolehlivější a korektnější pracovat s tím, že hledaný jev se vyskytuje nikoli přímo s&nbsp;naměřenou frekvencí, ale s frekvencí, která se nechází v nějakém rozsahu (statistici by řekli v&nbsp;<em>konfidenčním intervalu</em>).<br/> Tento interval je v modulu znázorněn dvojím způsobem: jednak je pro zadanou frekvenci (a frekvence okolní) naznačen tzv. chybovými úsečkami ve tvaru písmene <samp>I</samp> a jednak je prostřednictvím pravděpodobnostní funkce znázorněno, jaké hodnoty jsou už na zvolené hladině významnosti (specifikující přijatelnou míru omylu) za daným intervalem.<br/> V obou případech je pro výpočet konfidenčních intervalů použito <a href='https://cs.wikipedia.org/wiki/Binomické_rozdělen%C3%AD'>binomické rozdělení pravděpodobnosti</a>.",
        "en": "This module can help correctly interpreting corpus frequencies. When working with corpus data, we tend to forget that a frequency reported by the corpus is only a <em>point estimate</em> of its actual frequency in actual language. Considering the pervasive variability caused by a number of factors related to the process of corpus composition (its processing and even evaluation of the query), it is more reliable as well as more correct to assume the search term does not occur with the frequency reported, but with a frequency within a certain range (statisticians say in a <em>confidence interval</em>).<br/> This interval is represented in two ways in this module: first, in case of the input frequency (and adjacent frequencies), it is represented by the error bars (shaped like the letter <samp>I</samp>); second, the probability function shows values that, given the selected level of significance (representing the acceptable level of error), are already beyond that interval.<br/> In both cases a <a href='https://en.wikipedia.org/wiki/Binomial_distribution'>binomial probability distribution</a> was used."
      },
      {"cs": "Frekvence a jejich intervaly", "en": "Frequencies and their intervals"},
      {
        "cs": "Každý bod v reprezentuje jednu frekvenci (zvýrazněná je frekvence zadaná). Okolo bodu je chybovými úsečkami naznačen konfidenční interval. Skutečná frekvence se (s pravděpodobností omylu α) vyskytuje v rámci tohoto intervalu.", 
        "en": "Each point represents one frequency (the input frequency is highlighted) and the error bars around it show the confidence interval. The actual frequency (with the error probability of α) is inside this interval."
      },
      {"cs": "Konfidenční interval a extrémy", "en": "Confidence intervals and extremes"},
      {
        "cs": "Pravděpodobnostní funkce ukazuje binomické rozložení pravděpodobnosti v konfidenčním intervalu. Modře zvýrazněná hodnota odpovídá zadané frekvenci, oranžově zvýrazněné jsou frekvence ležící za hranicí konfidenčního intervalu (extrémy).", 
        "en": "The probability function shows binomial probability distribution inside the confidence interval. The value highlighted in blue corresponds to the input frequency, the frequencies highlighted in orange lie outside the confidence interval (extremes)."
      },
      {"cs": "Zadaná frekvence přesahuje velikost korpusu.", "en": "Observed frequency is larger than the corpus size."},

      
      {"cs": "2 slova v 1 korpusu", "en": "2 words in 1 corpus"},
      {"cs": "Frekvence slova 1", "en": "Word 1 frequency"},
      {"cs": "Frekvence slova 2", "en": "Word 2 frequency"},
      {"cs": "Slovo 1", "en": "Word 1"},
      {"cs": "Slovo 2", "en": "Word 2"},
      {"cs": "Statistická signifikance", "en": "Statistical significance"},
      {"cs": "Statistický test:", "en": "Statistical test:"},
      {"cs": "Chi2 test", "en": "Chi2 test"},
      {"cs": "Fisherův exaktní test", "en": "Fisher's exact test"},
      {"cs": "Binomický test", "en": "Exact Binomial Test"},
      {"cs": "Log-likelihood test", "en": "Log-likelihood test"},
      {"cs": "Testová statistika:", "en": "Test statistic:"},
      {
        "cs": "Rozdíl <strong>není</strong> na zvolené hladině významnosti",
        "en": "The difference <strong>is not</strong> statistically significant on the"
      },
      {"cs": "statisticky signifikantní.","en": "level of significance."},
      {
        "cs": "Rozdíl <strong>je</strong> na zvolené hladině významnosti",
        "en": "The difference <strong>is</strong> statistically significant on the"
      },
      {"cs": "Effect size", "en": "Effect size"},
      {
        "cs": "<a href='https://wiki.korpus.cz/doku.php/manualy:kwords#princip_fungovani'><b>DIN</b></a>:", 
        "en": "<a href='https://wiki.korpus.cz/doku.php/en:manualy:kwords#how_it_works'><b>DIN</b></a>:"
      },
      {"cs": "bodový odhad", "en": "point estimate"},
      {"cs": "bodový odhad; konfidenční interval: ", "en": "point estimate; confidence interval: "},
      {
        "cs": "Poměr relativní frekvence Slova 1 k relativní frekvenci Slova 2 se nachází v&nbsp;rozmezí od", 
        "en": "Ratio between relative frequency of Word 1 and Word 2 ranges from"
      },
      {
        "cs": "Tento modul slouží k porovnání frekvencí dvou jevů (tedy ne nutně pouze slov, jak naznačuje název) v jednom korpusu a příp. k potvrzení jejich odlišnosti. K takovému srovnání lze využít jednak statistické testy (implentovány jsou pouze ty nejpoužívanější), které se interpretují především na základě tzv. <em>statistické signifikance</em> vyjádřené pomocí <em>p-value</em> (viz spodní část výsledkového sloupce).<br/> Nejen v lingvistice se ovšem čím dál častěji upozorňuje, že tato hodnota není nejlepším ukazatelem významnosti rozdílu, a proto se dnes už běžně doplňuje o údaj reflektující relevanci, tzv. <em>effect size</em> (implementovány jsou opět pouze některé používané míry). Vizualizace v&nbsp;grafu pak umožňuje srovnat zadané frekvence při zohlednění jejich konfidenčních intervalů",
        "en": "This module can compare frequencies of two features (not only words as the title might suggest) in a single corpus and it can also confirm their difference. Such a comparison may be drawn on the basis of statistical tests (only the most common are implemented) that are interpreted especially on the basis of the <em>statistical significance</em> expressed by the <em>p-value</em> (see the bottom of the result column).<br/> It has been noted even outside linguistics that this value is not the best indicator of the significance of difference. It is, therefore, often supplemented by the value expressing relevance, i.e. <em>effect size</em> (again only some measures are implemented). The graph allows the comparison of the input frequencies taking account of their confidence intervals"
      },
      {"cs": "(srov. s", "en": "(cf."},
      {"cs": "prvním modulem", "en": "first module"},
      {"cs": "Porovnání konfidenčních intervalů", "en": "Confidence interval comparison"},
      {
        "cs": "Sloupce naznačují frekvence jevů (převedené na ipm), chybová úsečka pak ukazuje konfidenční interval, v němž se frekvence v jazyce mohou pohybovat. Pokud se konfidenční intervaly překrývají, může jít (navzdory naměřeným hodnotám) ve skutečnosti o stejně frekventované jevy.", 
        "en": "Bars indicate feature frequencies (in ipm) while the error bar indicates the confidence interval which delimits the range of frequencies in the whole lamgauge. Despite the difference in input frequencies, overlapping confidence intervals may indicate the sameness of frequencies."
      },
      {"cs": "Kliknutím na oblast grafu provedete zoom in/out.", "en": "Zoom in/out by clicking in the graph."},
      {"cs": "Zadané frekvence přesahujou velikost korpusu.", "en": "Observed frequencies are larger than the corpus size."},
      
      
      {"cs": "2 slova ve 2 korpusech", "en": "2 words in 2 corpora"},
      {"cs": "Velikost korpusu A", "en": "Corpus A size"},
      {"cs": "Velikost korpusu B", "en": "Corpus B size"},
      {"cs": "Velikost korpusu A (slova nebo pozice)", "en": "Corpus size A (tokens or words)"},
      {"cs": "Velikost korpusu B (slova nebo pozice)", "en": "Corpus size B (tokens or words)"},
      {
        "cs": "Pokud potřebujem porovnat frekvence <em>dvou jevů ve dvou různých korpusech</em>, lze využít tento modul, který je zobecněným případem modulu", 
        "en": "If you need to compare frequencies of <em>two features in two different corpora</em>, you can use this module that is a generalised case of the module "
      },
      {
        "cs": "představeným výše. Sdílí s&nbsp;ním nejen způsob vyhodnocení (testy statistické signifikance i způsoby výpočtu effect size), ale i grafické znázornění.", 
        "en": "introduced above. It shares with it not only the means of evaluating the data (statistical significance tests and means of effect size calculation), but also the visualisation."
      },
      
      
      {"cs": "1 jev – víc vzorků", "en": "1 feature – many samples"},
      {"cs": "Spolehlivost vzorků", "en": "Samples reliability"},
      {"cs": "Velikost základního souboru (populace)", "en": "Source sample (population) size"},
      {"cs": "Velikost vzorku", "en": "Sample size"},
      {"cs": "Výsledky z analýzy vzorků", "en": "Results of sample analysis"},
      {"cs": "Hodnoty zadávejte jako celá čísla oddělená čárkou.", "en": "Comma separated values (integers)."},
      {"cs": "Výsledky", "en": "Results"},
      {"cs": "Průměr hodnot", "en": "Mean"},
      {"cs": "Standardní odchylka", "en": "Standard deviation"},
      {"cs": "Studentovo rozdělení", "en": "Student's distribution"},
      {"cs": "Normální rozdělení", "en": "Normal distribution"},
      {"cs": "Populace", "en": "Population"},
      {
        "cs": "Průměrně se sledovaný jev v základním souboru vyskytuje s frekvencí",
        "en": "The average frequency of a phenomenon under consideration in population is"
      },
      {"cs": "s konfidenčním intervalem od", "en": "with confidence interval ranging from"},
      {"cs": "do", "en": "to"},
      {"cs": "Vzorek", "en": "Sample"},
      {
        "cs": "Průměrně se sledovaný jev ve vzorcích vyskytuje s frekvencí",
        "en": "The average sample frequency of a phenomenon under consideration is"
      },
      {"cs": "Schématické znázornění", "en": "Illustrative plot"},
      {"cs": "Hodnoty měření", "en": "Observed values"},
      {"cs": "Počet vzorků", "en": "Samples"},
      {"cs": "Hodnota", "en": "Value"},
      {"cs": "Konfidenční interval a vývoj průměru", "en": "Confidence interval and average"},
      {
        "cs": "Čteme-li graf zleva doprava, vidíme, jak se přidáváním vzorků mění odhad frekvence zkoumaného jevu a spolu s tím, jak se zmenšuje konfidenční interval (zvyšuje se přesnost odhadu).", 
        "en": "Reading the graph from left to right, you will notice that by adding samples, the frequency estimate changes and with it, the confidence interval decreases (the precision of the estimate increases)."
      },
      {
        "cs": "Tento modul je určen k vyhodnocování spolehlivosti výsledků získaných manuální analýzou jevu v různém počtu náhodných vzorků (typicky z rozsáhlé konkordance, kterou nelze celou detailně prozkoumat). Obvyklým problémem takové analýzy je to, že nejsme schopni určit, kolik dílčích vzorků a s jakou velikostí je třeba ručně prozkoumat, aby byl náš odhad spolehlivý. Univerzální odpověď na tuto otázku dát nelze, protože to závisí na mnoha okolnostech (zejm. na frekvenci a rozpýtelnosti analyzovaného jevu), můžeme nicméně na základě tzv. <em>centrálního limitního teorému</em> odhadnout, v jakém intervalu se daný jev v celé konkordanci vyskytuje.<br/> Modul nabízí informaci o tom, jak se s postupným přidáváním vzorků zpřesňuje náš odhad (zužuje se <em>konfidenční interval</em>) frekvence sledovaného jevu. Na základě tohoto intervalu můžeme rozhodnout, zda nám taková přesnost stačí, či zda raději prozkoumáme další vzorky, abychom odhad ještě víc zpřesnili. Aplikace nabízí dva způsoby jak výpočet provádět: pomocí", 
        "en": "This module is intended to evaluate the reliability of results of manual analysis of a number of random samples (typically from an extensive concordance that is impossible to examine in detail). The usual problem of such analysis stems from our inability to determine the number and size of the individual samples necessary for a reliable estimate. There is no universal answer to this problem, because it depends on a number of factors (esp. on the frequency and dispersion of the feature), however, based on the <em>Central limit theorem</em>, we can estimate in what interval the feature in question appears in the whole concordance.<br/>  This module shows that by adding samples, the frequency estimate precision increases (the <em>confidence interval</em> narrows). It is then possible to decide, based on this interval, if a given precision is satisfactory enough, or if more samples should be analysed to increase the precision of the estimate. The app provides two ways to calculate this: using the" 
      },
      {"cs": "studentova", "en": "Student's"},
      {"cs": "a", "en": "and"},
      {"cs": "normálního", "en": "normal"},
      {
        "cs": "rozdělení, přičemž první z nich poskytuje většinou menší rozsah konfidenčního intervalu, zatímco druhý odhad bývá konzervativnější.",
        "en": "distribution. While the former usually returns a narrower confidence interval, the latter returns a more conservative estimate."
      },
      {"cs": "Je zadání v pořádku?", "en": "Is the input correct?"},
      {"cs": "Nejspíš jste v hodnotách měření udělali nějakou botu...", "en": "You may have an error in your input."},
      {"cs": "Problém v zadání?", "en": "Input error?"},
      {"cs": "Součet velikostí vzorků přesahuje velikost základního souboru...", "en": "The sum of the samples is larger than the source sample (population) size..."},
      
      
      
      {"cs": "Víc jevů – 1 vzorek", "en": "Many features – 1 sample"},
      {"cs": "Frekvence skupin", "en": "Frequency of groups"},
      {"cs": "Zadání pomocí URL", "en": "Input via URL"},
      {"cs": "např. https://kontext.korpus.cz/...", "en": "e.g. https://kontext.korpus.cz/..."},
      {"cs": "Manuální zadání", "en": "Manual input"},
      {"cs": "Celková frekvence jevu", "en": "Total frequency"},
      {"cs": "Velikost analyzovaného vzorku", "en": "Sample size"},
      {"cs": "Frekvence skupin (minimálně dvě hodnoty):", "en": "Frequency of groups (at least two values):"},
      {"cs": "URL konkordance (s vyznačením skupin):", "en": "Concordance URL (with marked groups):"},
      {"cs": "Spočti!", "en": "Go!"},
      {"cs": "Podíl marginální skupiny na celkové frekvenci jevu (v %):", "en": "Share of marginal group on total frequency (in %):"},
      {"cs": "Provádím bootstrap", "en": "Bootstrapping"},
      {"cs": "Hotovo ", "en": "Done "},
      {"cs": "spodní limit", "en": "lower limit"},
      {"cs": "horní limit", "en": "upper limit"},
      {"cs": "Podíl", "en": "Proportion"},
      {"cs": "Skupiny", "en": "Groups"},
      {"cs": "Skupina", "en": "Group"},
      {"cs": "Frekvence skupin ve vzorku", "en": "Group frequencies in the sample"},
      {"cs": "Hypergeometrický model", "en": "Hypergeometric model"},
      {"cs": "Binomický model", "en": "Binomial model"},
      {"cs": "Pravděpodobnost výskytu marginální", "en": "Probability of marginal"},
      {"cs": "skupiny ve vzorku", "en": "group in the sample"},
      {
        "cs": "Minimální velikost vzorku pro spolehlivé zachycení zástupce marginální skupiny (při ", 
        "en": "Minimal sample size for reliable detecting an occurence from marginal group (with "
      },
      {"cs": "% hladině chyby", "en": "% error rate"},
      {"cs": "Konfidenční intervaly skupin", "en": "Confidence intervals for groups"},
      {"cs": "Neplatná URL", "en": "Invalid URL"},
      {"cs": "Chyba v zadání", "en": "Invalid input"},
      {"cs": "V konkordanci nejsou označené skupiny", "en": "There are no groups in the concordance"},
      {
        "cs": "Při zkoumání náhodného vzorku rozsáhlé konkordance můžeme rozdělit výskyty na různý počet skupin (např. významů hledaného slova). Rozhraní <a href='https://kontext.korpus.cz'>KonText</a> umožňuje tyto skupiny <a href='http://wiki.korpus.cz/doku.php/manualy:kontext:konkordance#prace_s_konkordanci'>označit čísly</a>, uložit a informaci o rozdělení do skupin zakódovat do URL konkordance, která slouží jako vstup pro tento modul (pokud KonText nepoužíváte, můžete použít <em>Manuální zadání</em>). <br/>Ze zadaných informací můžeme pomocí tzv. <em>bootstrappingu</em> zjistit konfidenční intervaly pro každou nalezenou skupinu a vyhodnotit, do jaké míry jsou spolehlivé údaje jednak o <em>existenci jednotlivých skupin</em> a jednak o <em>jejich pořadí</em> (vždy s&nbsp;ohledem na velikost analyzovaného vzorku). Zároveň modul vypočítá, jaká je pravděpodobnost alespoň jednoho výskytu skupiny, kterou bysme označili jako marginální (např. menšinového významu), ve zkoumaném vzorku.", 
        "en": "Description: to be translated"
      },
      {"cs": "Doloženost skupin a jejich pořadí", "en": "Groups attestation and their ranking"},
      {
        "cs": "Sloupce představují frekvenci skupin ve vzorku, chybová úsečka pak naznačuje konfidenční interval, v němž se frekvence můžou pohybovat (např. v jiném vzorku). Pokud se konfidenční intervaly dvou sloupců překrývají, znamená to, že nelze jednoznačně tvrdit, že jedna skupina je vždy frekventovanější než druhá. Pokud konfidenční interval zahrnuje nulu (sloupec se zbarví do oranžova), nelze vyloučit, že taková skupina by se v jiném vzorku vůbec nevyskytla (jsou tedy oprávněné pochyby o její doloženosti).", 
        "en": "TBT"
      },
      
      
      
      {"cs": "Lexikální bohatost (zTTR)", "en": "Lexical richness (zTTR)"},
      {"cs": "Počet typů", "en": "Number of types"},
      {"cs": "Počet tokenů", "en": "Number of tokens"},
      {"cs": "Druh textu", "en": "Text category"},
      {"cs": "Psaný - beletrie (SYN2015)", "en": "Written - fiction (SYN2015)"},
      {"cs": "Psaný - oborová literatura (SYN2015)", "en": "Written - non-fiction (SYN2015)"},
      {"cs": "Psaný - publicistika (SYN2015)", "en": "Written - newspapers (SYN2015)"},
      {"cs": "Mluvený - spontánní konverzace (Oral v1)", "en": "Spoken - private conversation (Oral v1)"},
      {"cs": "Psaný - beletrie (InterCorp v11)", "en": "Written - ficiton (InterCorp v11)"},
      {"cs": "Psaný - oborová literatura (InterCorp v11)", "en": "Written - non-ficiton (InterCorp v11)"},
      {"cs": "Typ jednotky", "en": "Unit type"},
      {"cs": "Analyzovaný jazyk", "en": "Analysed language"},
      {"cs": "čeština", "en": "Czech"},
      {"cs": "angličtina", "en": "English"},
      {"cs": "Medián – IQR model", "en": "Median – IQR model"},
      {"cs": "Průměr – SD model", "en": "Mean – SD model"},
      {"cs": "Výsledek", "en": "Result"},
      {"cs": "Vypočítané zTTR", "en": "Calculated zTTR"},
      {"cs": "Vypočítané zqTTR", "en": "Calculated zqTTR"},
      {"cs": "Očekávaná hodnota", "en": "Expected value"},
      {"cs": "Naměřená hodnota", "en": "Observed value"},
      {"cs": "Hustota pravděpodobnosti", "en": "Probability density"},
      {"cs": "Vstupní a referenční hodnoty", "en": "Input and referential values"},
      {"cs": "Veličina", "en": "Variable"},
      {"cs": "Naměřené TTR", "en": "Observed TTR"},
      {"cs": "Referenční hodnota TTR", "en": "Referential value of TTR"},
      {"cs": "Disperze TTR", "en": "TTR dispersion"},
      {"cs": "Frekvence zkoumaného jevu v jednotlivých vzorcích", "en": "Sample frequency of a phenomenon under examination"},
      {
        "cs": "Modul slouží k určení <em>lexikální bohatosti textu</em> na základě poměru počtu typů a tokenů, tedy tzv. <em>TTR</em> (= <em>type token ratio</em>). Tento ukazatel je sice jednoduchý, ale zároveň je neuspokojivý v tom, že je vždy závislý na délce textu (čím delší text máme, tím víc různých slov obsahuje, zároveň platí, že nové typy přibývají pomaleji, jak text narůstá). Jelikož od tohoto vlivu neumí nijak abstrahovat, nelze ho použít pro porovnávání textů nestejné délky. Řešením je využití alternativního indexu <em>zTTR</em> <a href='https://link.springer.com/article/10.1007/s11185-015-9151-8'>(Cvrček – Chlumská 2015)</a>, který zadané hodnoty konkrétního textu (tokeny a typy) porovnává s hodnotami referenčními, tedy s hodnotami, které jsou pro text dané délky a daného typu obvyklé.<br/> Původní návrh indexu <em>zTTR</em> porovnával zadané hodnoty s průměrem a směrodatnou odchylkou referenčních dat", 
        "en": "This module can determine the <em>lexical richness of text</em> based on the type/token ratio (<em>TTR</em>). This indicator while simple is also unsatisfactory in that it is always dependent on the text size (the longer text we have, the more words it contains - and at the same time, with longer text, new types accumulate more slowly). Since it cannot abstract from this influence, it cannot be used for comparisons of texts of different lengths. To solve this, we use an alternative <em>zTTR</em> index <a href='https://link.springer.com/article/10.1007/s11185-015-9151-8'>(Cvrček – Chlumská 2015)</a>, which compares the input values (tokens and types) to reference values that are typical for a text of a given length and type. <br/> The original <em>zTTR</em> index compared the input values with the average and standard deviation of the reference data"
      },
      {"cs": "(viz", "en": "(see"},
      {
        "cs": "novější modifikovaná verze (pro odlišení nazývaná <em>zqTTR</em>) počítá s neparametrickými hodnotami mediánu a mezikvartilového rozpětí", 
        "en": "the newer modified version (differentiated by a new name: <em>zqTTR</em>) uses non-parametric values of median and inter-quartile range"
      },
      {"cs": "(tzv.", "en": "(so called"},
      {
        "cs": "který můžem považovat za adekvátnější vzhledem k obecnému charakteru jazykových dat. <br/>V současnosti jsou implementovány modely pouze pro češtinu.", 
        "en": "that can be seen as more adequate with respect to the general character of language data. <br/>At the moment, only the models for Czech are available."
      },
      {"cs": "Naměřená a referenční hodnota", "en": "Observed and expected value"},
      {
        "cs": "Graf schématicky znázorňuje pozici naměřené lexikální bohatosti ku hodnotě obvyklé (medián pro texty stejné délky). Je-li naměřená hodnota nižší než referenční, je výsledná hodnota zqTTR záporná, je-li naopak vyšší, je hodnota zqTTR kladná.", 
        "en": "The graph is a schematic visualisation of the position of the observed lexical richness in relation to an expected value (median for texts of the same length). If the observed value is lower than the reference value, the resulting zqTTR index is negative, if the value is higher, the zqTTR index is positive."
      },
      {
        "cs": "Graf schématicky znázorňuje pozici naměřené lexikální bohatosti ku hodnotě obvyklé (průměr pro texty stejné délky). Je-li naměřená hodnota nižší než referenční, je výsledná hodnota zTTR záporná, je-li naopak vyšší, je hodnota zTTR kladná.",
        "en": "The graph is a schematic visualisation of the position of the observed lexical richness in relation to an expected value (average for texts of the same length). If the observed value is lower than the reference value, the resulting zTTR index is negative, if the value is higher, the zTTR index is positive."
      },
      
      
      

      
      
      {"cs": "Korespondence n-gramů", "en": "N-gram correspondence"},
      {"cs": "Výchozí jazyk (L1)", "en": "Source language (L1)"},
      {"cs": "Cílový jazyk (L2)", "en": "Target language (L2)"},
      {"cs": "Délka n-gramu v L1 (n)", "en": "N-gram size in L1 (n)"},
      {"cs": "Minimální frekvence v L1 (t)", "en": "Frequency threshold in L1 (t)"},
      {"cs": "Model", "en": "Model"},
      {"cs": "Jak n-gramy namíchat pro srovnání", "en": "How to mix n-grams for comparison"},
      {
        "cs": "Obecná podoba modelu vycházející z rovnosti počtu typů (T) v obou jazycích", 
        "en": "The general form of the model assuming equal number of types (T) in both languages"
      },
      {"cs": "se při doplnění zadaných parametrů a koeficientů specifických pro vybraný jazykový pár", "en": "can be specified by input parameters and language-pair specific coefficients"},
      {"cs": "změní do konkretizované podoby", "en": "to this concrete form:"},
      {"cs": "Modelovaná", "en": "Model"},
      {"cs": "Původní", "en": "Original"},
      {"cs": "Velikost n-gramu", "en": "N-gram size"},
      {"cs": "Počet typů (T)", "en": "Number of types (T)"},
      {"cs": "Jazyk", "en": "Language"},
      {"cs": "Data", "en": "Data"},
      {"cs": "Jednotky o velikosti, kterou předpokládá model", "en": "Units expected by the model"},
      {"cs": "-gramy", "en": "-grams"},
      {
        "cs": "nemusí reálně existovat, lze si ovšem takovou velikost n-gramu konceptualizovat jako průměr délek různě rozsáhlých n-gramů.", 
        "en": "may not exist in the real world, however, we may conceptualize them as an average size in the set of differently large n-grams."
      },
      {"cs": "Požadované hodnoty <em>n</em> v tomto případě dosáhneme, pokud namícháme n-gramy s frekvencí vyšší než", "en": "Required value of <em>n</em> can be achieved in this particular case by mixing n-grams with frequency above"},
      {"cs": "o délce", "en": "with sizes of"},
      {"cs": "tokeny v poměru", "en": "tokens in following ratio"},
      {"cs": "tokeny např. v poměru", "en": "tokens e.g. in following ratio"},
      {"cs": "varianta s převahou jednoho typu", "en": "most dispersed variant"},
      {"cs": "nebo", "en": "or"},
      {"cs": "varianta s vyrovnaným počtem typů", "en": "evenly dispersed variant"},
      {"cs": "Neplatný rozsah délky n-gramu (1–12).", "en": "Invalid range of n-gram size (1–12)."},
      {
        "cs": "Při mezijazykovém srovnávání víceslovných jednotek narážíme na problém, že si jednotky stejné délky (2-gram, 3-gramy atp.) nemusí z důvodu typologické odlišnosti přesně odpovídat. Pro vyrovnání tohoto rozdílu lze vytvořit kvantitativní model, který je založen na ekvivalenci počtu typů (T) mezi srovnávanými jazyky (podrobnosti viz Milička – Cvrček – Lukešová, připravuje se). Jeho vstupními parametry jsou <em>n</em> (=délka n-gramu) a <em>t</em> (=frekvenční minimum), protože to jsou hlavní faktory, které počet typů můžou ovlivnit. Tyto parametry lze pro každý jazykový pár modifikovat koeficienty <em>a</em> a <em>b</em>. Aplikací těchto koeficientů v modelu zjistíme pro daný pár jazyků, jaké hodnoty <em>n</em> a <em>t</em> si odpovídají (viz schématické znázornění pomocí interpolace v grafu).<br/> Zvýšení či snížení frekvenčí hladiny <em>t</em> je většinou při extrakci dat z korpusu jednoduché a poměrně intuitivní, problémy může činit hodnota <em>n</em>, která po transformaci nemusí být celé číslo (např. 2.37-gram). Pokud ovšem hodnotu <em>n</em> chápame jako průměr v nějakém vzorku, lze desetinné hodnoty tohoto parametru dosáhnout smícháním n-gramů různé délky (viz box pod grafem).", 
        "en": "Description: to be translated"
      },
      {"cs": "Počty n-gramů podle velikosti", "en": "Number of n-grams by their size"},
      {
        "cs": "Přerušované čáry reprezentují počet různých n-gramů (typů) v závislosti na jejich délce ve zvolených jazycích. Plná čára vznikla interpolací dat cílového jazyka na základě kvantitativního modelu a naznačuje, jak se oba jazyky aplikací vyrovnávacích koeficientů vzájemně přibližují.", 
        "en": "TBT"
      },
      
      
      
      {"cs": "O aplikaci", "en": "About"},
      {"cs": "Vítejte", "en": "Welcome"},
      {"cs": "Tato kalkulačka by měla poskytnout uživatelům korpusů rychlou pomoc při počítání základních statistických úloh, s nimiž se lze v rámci výzkumu běžně setkat. Aplikace je rozdělena do několika modulů, které odpovídaj různým výzkumným situacím.", 
      "en": "This calculator should provide quick support to corpus users when calculating basic statistical tasks most commonly encountered in research. The app is divided into a number of modules reflecting specific research problems."
      },
      {"cs": "První modul", "en": "The first module"},
      {
        "cs": "vlastně nepočítá žádný statistický test a slouží jako pomůcka pro adekvátní interpretaci frekevencí. Měl by pomoct s odpovědí na otázku: <em>Co to přesně znamená, když jev, který mě zajímá, má v korpusu frekvenci X výskytů?</em>", 
        "en": "does not in fact do any statistical testing as such but serves as a tool for adequate frequency interpretation. It should help you answer the question: <em>What exactly does it mean, when a feature I am interested in has a frequency X in a corpus?</em>"
      },
      {"cs": "Druhý modul", "en": "The second module"},
      {
        "cs": "porovnává dvě frekvence (např. dvě konkurenční varianty v jednom korpusu) a zjišťuje, jak významný je jejich rozdíl a jestli třeba za tím není jenom náhodná variabilita.", 
        "en": "compares two frequencies (e.g. two competing variants in one corpus) and determines, how significant their difference really is and whether their difference is not just a result of a random variation."
      },
      {"cs": "Typickým příkladem využití modulu", "en": "The typical use case of the module"},
      {
        "cs": "je identifikace <em>klíčových slov</em> – jednotek, které jsou v jednom korpusu významně častějc než v jiném (při zohlednění velikosti použitých korpusů). Využít ho můžem ale v jakémkoli srovnávání frekvencí jednotek napříč korpusy.", 
        "en": "is the identification of <em>keywords</em> – units that are significantly more common in one of two corpora (considering the size of the two corpora). It is, however, useful for any comparison of frequencies across different corpora."
      },
      {"cs": "Čtvrtý modul", "en": "The fourth module"},
      {
        "cs": "pomáhá s určením míry přesnosti a spolehlivosti analýzy provedené na náhodných vzorcích. Pokud v něm vychází rozpětí pro hledaný jev jako příliš velké, bude nejspíš třeba pro zpřesnění přidat další vzorky.", 
        "en": "helps in establishing the level of precision and reliability of a random sample analysis. If the resulting span (for the feature under scrutiny) is too broad, it might be advisable to improve the precision by adding more samples."
      },
      {"cs": "Šestý modul nazvaný", "en": "The sixth module"},
      {
        "cs": "je pro poměřování textů z hlediska jejich lexikální bohatosti (poměr počtu různých slov k délce textu). Jeho předností je, že výsledná hodnota indexu <em>zTTR</em> je porovnatelná i mezi texty nestejné délky.", 
        "en": "compares the lexical richness (the length of the text in relation to the number of lexical units it contains) of texts. Its advantage is that the resulting <em>zTTR</em> index is comparable even between texts of different length."
      },
      {"cs": "Modul", "en": "Module"},
      {"cs": "frekvence skupin", "en": "frequency of groups"},
      {
        "cs": "slouží k posouzení toho, jak jsou zastoupeny skupiny jevů (např. významů) v analyzovaném vzorku či konkordanci. Můžeme s jeho pomocí odpovědět na otázku, jestli je skutečně jedna skupina častější než druhá nebo zda lze určitou skupinu považovat skutečně za doloženou.", 
        "en": "tbt"
      },
      {
        "cs": "Při srovnávání víceslovných jednotek mezi dvěma jazyky narážíme často na otázku, zda si odpovídají n-gramy stejné délky. K zjištění", 
        "en": "tbt"
      },
      {"cs": "korespondence n-gramů", "en": "N-grams correspondence"},
      {
        "cs": "slouží sedmý modul, který ukazuje, čemu ideálně odpovídá např. soupis nejfrekventovanějších bigramů v jednom jazyce při porovnání s jazykem druhým.", 
        "en": "TBT"
      },
      {
        "cs": "Poděkování za pomoc při přípravě této aplikace patří D. Lukešovi, O. Tichému, J. Kockovi, D. Kováříkové a J. Miličkovi.",
        "en": "Thanks to D. Lukeš, O. Tichý, J. Kocek, D. Kováříková and J. Milička for their help and assistance."},
      
      
      
      
      {"cs": "Nekorektní zadání", "en": "Incorrect input"},
      {"cs": "Velikost korpusu nemůže být nulová.", "en": "It is impossible to have a zero size of the corpus"},
      {
        "cs": "Výpočet statistické signifikance nelze s tímto zadáním provést.",
        "en": "Statistical significance cannot be calculated."
      },
      {"cs": "Příklad", "en": "Example"},
      {
        "cs": "Ve stomilionovém korpusu SYN2015 najdeme slovo <em>čtvrthodinka</em> přesně 100×. Nelze přitom předpokládat, že v jiném korpusu o stejné velikosti a podobném složení dosáhneme zcela identické hodnoty. Důvodem je to, že každý korpus je vzorkem z populace všech textů a jako takový je zatížen nějakou vzorkovací chybou. Přistoupíme-li na to, že přijatelná pravděpodobnost chybného úsudku je 5 %, můžeme místo naměřené hodnoty pracovat s rozsahem hodnot 81–122, v němž se s 95% pravděpobností zkoumané slovo v celé populaci vyskytuje.", 
        "en": "TBS"
      },
      {
        "cs": "V pětimilionovém korpusu Oral v1 najdeme lemmata <em>šedý</em> 103× a <em>šedivý</em> 85×. Ačkoli se naměřené frekvence na první pohled liší, nemusí to ještě signalizovat skutečný rozdíl. Pokud si okolo každé z frekvencí načrtneme konfidenční interval, zjistíme, že se jejich rozsah značně překrývá. To znamená, že nelze vyloučit (se stanovenou mírou chyby), že se obě slova vyskytují v celé populaci stejně často a rozdíl mězi nimi je daný náhodou.", 
        "en": "TBS"
      },
      {
        "cs": "Lemma <em>člověk</em> se sice vyskytuje v korpusu projevů SPEECHES jen 571×, zatímco v korpusu Oral v1 celkem 10189×, vezmeme-li nicméně v úvahu nestejné velikosti korpusů, zjistíme, že relativní četnost (ipm nebo ipw) je v prvním případě podstatně vyšší než v druhém. Abychom zjistili, zda nejde o rozdíl pouze náhodný, načrtneme kolem relativních frekvencí konfidenční intervaly. Pokud se intervaly nepřekrývají, můžeme konstatovat (se stanovenou mírou omylu), že v prvním z korpusů je slovo významně častější.", 
        "en": "TBS"
      },
      {
        "cs": "Potřebujeme zjistit podíl gen. sg. ve výskytech tvaru <em>hřiště</em> (může to být i nom. či ak.), který se celkově v korpusu SYN2015 s frekvencí 3890. Pokud nechceme použít morfologické značkování, musíme se uchýlit k ruční analýze po náhodných vzorcích. Zvolíme si jejich velikost (např. 100 výskytů) a do formuláře zadáváme počet nalezených genitivů v každém ze vzorků (35, 39, 38...). S přidáváním vzorků odhad zpřesňujeme, což se projevuje zužováním konfidenčního intervalu, v němž je (se stanovenou mírou chyby) reálný výsledek v celé konkordanci. Pokud nám přesnost odhadu nevyhovuje, musíme přidat další vzorek.", 
        "en": "TBS"
      },
      {
        "cs": "Beletristický text o celkové délce 10000 tokenů obsahuje 1500 různých lemmat (typů). Porovnáváme ho s jinými texty o stejné délce a zjišťujeme, že je v tomto srovnání podprůměrný, což reflektuje i záporná hodnota zTTR (příp. zqTTR).", 
        "en": "TBS"
      },
      {
        "cs": "Ve vzorku 100 výskytů slova <em>měkký</em> jsme identifikovali 6 významů. Chceme vědět, zda je lze považovat na takovémto vzorku za doložené a jaké je jejich pořadí podle frekvence. S obojím nám pomůžou konfidenční intervaly (viz graf i tabulka), které naznačují, v jakém rozpětí by se výsledky při opakování analýzy mohly vyskytnout. Máme-li navíc důvodné podezření, že hledané slovo má ještě jeden význam, který se ve vzorku neobjevil, můžeme odhadnout, jak pravděpodobné to je. Pokud si stanovíme, že náš význam představuje minimálně 1 % z celkové frekvence slova <em>měkký</em>, je pravděpodobnost, že se objeví ve vzorku o 100 výskytech, zhruba 63 %.", 
        "en": "Example: to be translated"
      },
      {
        "cs": "Chceme-li najít korespondenci mezi bigramy v češtině s minimální frekvencí 10 a n-gramy v němčině, musíme použít příslušné předpočítané koeficienty <em>a</em> a <em>b</em>. S jejich pomocí zjistíme, že českým bigramům odpovídají německé 2.34-gramy s minimální frekvencí 10.3. Tuto korespondenci schématicky zachycuje graf počtu typů (T) v obou jazycích, naznačující zároveň, jak vypadala originální data pro němčinu a jak vypadají po transformaci. Box pod grafem pak ukazuje, v jakém poměru namíchat 2-gramy a 3-gramy, abychom ve výsledku dostali průměrnou délku rovnající se transformovanému <em>n</em>.", 
        "en": "Example: to be translated"
      },
      {"cs": "Český národní korpus", "en": "Czech National Corpus"}
    ]
}
